/////////////////////////////////////////////////////////////////////////
//
//											 SYS_Clock.h
//											(SYS_Clock.c)
//		Настройка системы тактирования.
//		Для МК: STM32F205, STM32F207, STM32F215, STM32F217
//
//		Foton6
//		29.10.2015
//
//
/////////////////////////////////////////////////////////////////////////

#ifndef __SYS_Clock
#define	__SYS_Clock

#include <stdint.h>
#include "stm32f10x.h"


					//___________FLASH_ACR_LATENCY__________//

	#define d_FLASH_ACR_LATENCY 		 2			//__При работе на высокой частоте необходимо настроить согласно документации (0...2).
	
					//______Настройка регистра RCC_CR______//
	
	#define d_CR_PLLON			1				//__Включить PLL.
	#define d_CR_HSEBYP			0				//__Включить HSEBYP (внешний ГЕНЕРАТОР).
	#define d_CR_HSEON			1				//__Включить HSEON.

					//______Настройка регистра RCC_PLLCFGR______//
					
	#define d_PLLCFGR_PLLMUL		6				//__Значение множителя PLLMUL(4...9 или 6,5).
	#define	d_PLLCFGR_PLLXTPRE	0				//__Включить пределитель (HSE/2).
	#define d_PLLCFGR_PLLSRC		1				//__Источник тактирования для PLL (0 = HSI, 1 = HSE).


					//______Настройка регистра RCC_CFGR______//

	#define d_CFGR_PPRE2			0				//__Делитель системной частоты для шины APB2 (возможные значения: 0, 2, 4, 8, 16). Максимум 72MHz.
	#define d_CFGR_PPRE1			2				//__Делитель системной частоты для шины APB1 (возможные значения: 0, 2, 4, 8, 16). Максимум 36MHz.
	#define d_CFGR_HPRE				0				//__Делитель AHB (Рекомендуемые значения: 0, 2, 4, 8, 16. Но возможны также значения: 64, 128, 256, 512).
	#define d_CFGR_SW					2				//__Основной источник тактирования(0 - HSI, 1 - HSE, 2 - PLL).
	


	/////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//______________________________Прототипы функций для применения в проекте_________________________________//
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////

	uint32_t INIT_SYS_Clock (void);				//___Настройка системы тактирования.


//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//
//__________________________________Дальше настраивать ничего не нужно______________________________________//
//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//__//

	
	//______Коды возвращаемых функциями ответов______//

	#define Error_0  101UL
	#define Error_1  102UL
	#define Error_2  103UL
	#define Error_3  104UL
	#define Error_4  105UL
	#define CLOCK_OK	1UL					//__Система тактирования успешно настроена.

#endif	/*	__SYS_Clock		*/
